# Essential basic functionality

working with dates :
pd.date_range("day/month/year", periods=n)

In [7]:
import pandas as pd
import numpy as np

In [15]:
index = pd.date_range("13/1/2000", periods=5)
index

DatetimeIndex(['2000-01-13', '2000-01-14', '2000-01-15', '2000-01-16',
               '2000-01-17'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df = pd.DataFrame({
    "one": {"I":1,"II":2,"III":3},
    "two": {"II":3.0,"I":1.0,"III":3.0}
})
df

     one  two
I      1  1.0
II     2  3.0
III    3  3.0

To view a small sample of a Series or DataFrame object, use the head() and tail() methods.
head(n) --> gives a small sample of n rows from begining
tail(n) --> gives a small sample of n rows from end 
if n is not mentioned then by default it is taken as 5

In [27]:
df.head(2)

    one  two
I     1  1.0
II    2  3.0

In [28]:
df.tail(2)

     one  two
II     2  3.0
III    3  3.0

## shape

this is an attribute for dataframe which is used to tell the dimensions of the df

In [31]:
df.shape

(3, 2)

# Index

this is an attribute for dataframe which is used to return all indexes or row labels

In [40]:
df.index

Index(['I', 'II', 'III'], dtype='object')

# array

this is an attribute used to convert series into an array

In [42]:
df["one"].array

<PandasArray>
[1, 2, 3]
Length: 3, dtype: int64

# dtypes

this is an attribute used to display each an every columns data type as a series

In [45]:
df.dtypes

one      int64
two    float64
dtype: object

In [51]:
df.iloc[0]

one    1.0
two    1.0
Name: I, dtype: float64